In [1]:
#importing all libraries 
import pandas as pd
import numpy as numpy

In [8]:
df = pd.read_csv('sample_data_csv.csv')
df.head(5)

    Name  Age           City
0   John   30       New York
1  Alice   25    Los Angeles
2    Bob   35        Chicago
3  Emily   28        Houston
4  David   32  San Francisco

In [7]:
#this returns the last 3 rows in our dataframe 
df.tail(3)

    Name  Age           City
2    Bob   35        Chicago
3  Emily   28        Houston
4  David   32  San Francisco

In [10]:
#this returns only the age column from the dataframe
df[['Age']]

   Age
0   30
1   25
2   35
3   28
4   32

In [17]:
#this returns information about the dataframe
df.info

<bound method DataFrame.info of     Name  Age           City
0   John   30       New York
1  Alice   25    Los Angeles
2    Bob   35        Chicago
3  Emily   28        Houston
4  David   32  San Francisco>

In [14]:
#this returns descriptive statistics
df.describe()

             Age
count   5.000000
mean   30.000000
std     3.807887
min    25.000000
25%    28.000000
50%    30.000000
75%    32.000000
max    35.000000

In [16]:
#this returns (rows, columns)
#an attribute of a dataframe
df.shape

(5, 3)

In [19]:
#this returns data types
#an attribute of a dataframe
df.dtypes

Name    object
Age      int64
City    object
dtype: object